src/Reports/ОтчетПоПроизводственнымЗаданиямКанбанСводныйИстория/ОтчетПоПроизводственнымЗаданиямКанбанСводныйИстория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроизводственнымЗаданиямКанбанСводныйИстория</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МТК</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РемонтнаяКарта/РемонтнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтнаяКарта</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРемонта</name>
    <type>
      <types>CatalogRef.ПричиныРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоРазукомплектовки</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Неисправности</name>
    <attributes>
      <name>ПозицияНеисправногоМПЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеисправныйМПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияМестаНахожденияБрака</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоНахожденияБрака</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапЖизненногоЦикла</name>
      <type>
        <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБрака</name>
      <type>
        <types>CatalogRef.ВидыБрака</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаменяемыеЭлементы</name>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разукомплектовка</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчетПоПроизводственнымЗаданиямКанбанСводныйИстория/Forms/ФормаОтчета/Module.bsl
Функция ПолучитьВыпуск(ПЗ)	
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.Ссылка
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.ДокументОснование = &ПЗ
	|	И ВыпускПродукцииКанбан.МестоХранения <> &МестоХранения";
Запрос.УстановитьПараметр("ПЗ",ПЗ);
Запрос.УстановитьПараметр("МестоХранения",ПЗ.Линейка.Подразделение.МестоХраненияБрака);
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	Возврат(Выборка.Ссылка);
	КонецЦикла;
Возврат(Неопределено); 
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТаблицаПЗ.Очистить();
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
 
ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");	
ОблШапкаРабочееМесто = Макет.ПолучитьОбласть("Шапка|РабочееМесто");
ОблШапкаРемонт = Макет.ПолучитьОбласть("Шапка|Ремонт");
	
ОблПЗОбщие = Макет.ПолучитьОбласть("ПЗ|Общие");	
ОблПЗРабочееМесто = Макет.ПолучитьОбласть("ПЗ|РабочееМесто");
ОблПЗРемонт = Макет.ПолучитьОбласть("ПЗ|Ремонт");
	
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");	
ОблКонецРабочееМесто = Макет.ПолучитьОбласть("Конец|РабочееМесто");
ОблКонецРемонт = Макет.ПолучитьОбласть("Конец|Ремонт");

ОблШапкаОбщие.Параметры.ДатаНачала = Формат(Отчет.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщие.Параметры.ДатаОкончания = Формат(Отчет.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапкаОбщие.Параметры.Линейка = ""+Отчет.Линейка + " ("+Отчет.Линейка.Комментарий+")";
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого РМ Из СписокРМ Цикл
	ОблШапкаРабочееМесто.Параметры.РабочееМесто = РМ.Значение;
	ТабДок.Присоединить(ОблШапкаРабочееМесто);
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаРемонт);

ЗапросЛО = Новый Запрос;

ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.ПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Линейка = &Линейка
	|	И ЛьготнаяОчередь.ПЗ.ДатаЗапуска = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
ЗапросЛО.УстановитьПараметр("Линейка",Отчет.Линейка);
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданий.ПЗ
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданий.Линейка = &Линейка
	|	И (ЭтапыПроизводственныхЗаданий.ДатаНачала МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЭтапыПроизводственныхЗаданий.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон)";
	Если Не ЛинияSMD.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.ЛинияSMD = &ЛинияSMD";
	Запрос.УстановитьПараметр("ЛинияSMD",ЛинияSMD);
	КонецЕсли;
		Если Не Отчет.МТК.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование = &МТК";
		Запрос.УстановитьПараметр("МТК",Отчет.МТК);
		КонецЕсли; 
			Если СписокНоменклатуры.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.Изделие В ИЕРАРХИИ(&СписокИзделий)";
			Запрос.УстановитьПараметр("СписокИзделий",СписокНоменклатуры);
			КонецЕсли;
				Если Не ПоказыватьРемонт Тогда
				Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование.Ремонт = ЛОЖЬ";
				КонецЕсли;
Запрос.УстановитьПараметр("ДатаНач",Отчет.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон",Отчет.ДатаОкончания);
Запрос.УстановитьПараметр("Линейка",Отчет.Линейка);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТолькоВыпущенные Тогда
		Выпуск = ПолучитьВыпуск(ВыборкаДетальныеЗаписи.ПЗ);
			Если Выпуск <> Неопределено Тогда	
				Если (Выпуск.Дата < Отчет.ДатаНачала)или(Выпуск.Дата > Отчет.ДатаОкончания) Тогда
				Продолжить;
				КонецЕсли;
			Иначе
			Продолжить; 
			КонецЕсли; 
		КонецЕсли; 
			Если ТаблицаПЗ.НайтиСтроки(Новый Структура("ПЗ",ВыборкаДетальныеЗаписи.ПЗ)).Количество() = 0 Тогда
			ТЧ = ТаблицаПЗ.Добавить();
			ТЧ.ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
			ТЧ.Наименование = глНаименованиеВСкобкахБезЭтапа(ВыборкаДетальныеЗаписи.ПЗ.Изделие.Наименование);
			КонецЕсли; 
	КонецЦикла;
		Если СортировкаОтчёта = 1 Тогда
		ТаблицаПЗ.Сортировать("ПЗ");
		Иначе
		ТаблицаПЗ.Сортировать("Наименование,ПЗ");
		КонецЕсли;
ЗапросРемонт = Новый Запрос;

НомСтр = 0;
	Для каждого ТЧ из ТаблицаПЗ Цикл
	СписокРемонтныхКарт = Новый СписокЗначений;

	НомСтр = НомСтр + 1;
	ПЗ = ТЧ.ПЗ;
	СтатусРемонта = "";
	ЗапросРемонт.Текст = 
		"ВЫБРАТЬ
		|	РемонтнаяКарта.Ссылка,
		|	РемонтнаяКарта.Проведен
		|ИЗ
		|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
		|ГДЕ
		|	РемонтнаяКарта.ДокументОснование = &ДокументОснование";			
	ЗапросРемонт.УстановитьПараметр("ДокументОснование", ПЗ);		
	РезультатЗапросаРемонт = ЗапросРемонт.Выполнить();			
	ВыборкаДетальныеЗаписиРемонт = РезультатЗапросаРемонт.Выбрать();			
		Пока ВыборкаДетальныеЗаписиРемонт.Следующий() Цикл
		СписокРемонтныхКарт.Добавить(ВыборкаДетальныеЗаписиРемонт.Ссылка);
		СтатусРемонта = ?(ВыборкаДетальныеЗаписиРемонт.Проведен,"Завершён","Ремонт");
		КонецЦикла;				
	ОблПЗОбщие.Параметры.НомСтр = НомСтр;
	ОблПЗОбщие.Параметры.НомерПЗ = ПЗ.Номер;
    ОблПЗОбщие.Параметры.ПЗ = ПЗ;
	ОблПЗОбщие.Параметры.Линия = ПЗ.ЛинияSMD;
    ОблПЗОбщие.Параметры.Наименование = СокрЛП(ТЧ.ПЗ.Изделие.Наименование);
    ОблПЗОбщие.Параметры.Изделие = ПЗ.Изделие;
	ОблПЗОбщие.Параметры.Кол = ПЗ.Количество;
	ОблПЗОбщие.Параметры.Остановлено = ?(ПЗ.Остановлено,"О","");
	ВыборкаЛО.Сбросить();
		Если ВыборкаЛО.НайтиСледующий(Новый Структура("ПЗ",ПЗ)) Тогда
		ОблПЗОбщие.Параметры.ЛО = "ЛО";
		Иначе
		ОблПЗОбщие.Параметры.ЛО = "";
		КонецЕсли;                  	
	ТабДок.Вывести(ОблПЗОбщие);
	Отбор = Новый Структура("ПЗ",ПЗ);
		Для каждого РМ Из СписокРМ Цикл	
		ДатаНачала = "";
		ДатаОкончания = "";
		ТекПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.Выбрать(,,Отбор);
			Пока ТекПЗ.Следующий() Цикл
				Если ТекПЗ.РабочееМесто = РМ.Значение Тогда
				ДатаНачала = ТекПЗ.ДатаНачала;
				ДатаОкончания = ТекПЗ.ДатаОкончания;
				Прервать;
				КонецЕсли; 
			КонецЦикла;
		ОблПЗРабочееМесто.Параметры.ДатаНачала = ДатаНачала;
		ОблПЗРабочееМесто.Параметры.ДатаОкончания = ДатаОкончания;
		ТекОбл = ТабДок.Присоединить(ОблПЗРабочееМесто);
			Если ЗначениеЗаполнено(ДатаНачала) Тогда
				Если (ДатаНачала < Отчет.ДатаНачала)или(ДатаНачала > Отчет.ДатаОкончания) Тогда
				ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, ТекОбл.Лево).ЦветТекста = Новый Цвет(120,120,120);
				Иначе
				ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, ТекОбл.Лево).Шрифт = Новый Шрифт(,,Истина);
				КонецЕсли;
					Если (ДатаОкончания < Отчет.ДатаНачала)или(ДатаОкончания > Отчет.ДатаОкончания) Тогда
					ТабДок.Область(ТекОбл.Верх, ТекОбл.Право, ТекОбл.Низ, ТекОбл.Право).ЦветТекста = Новый Цвет(120,120,120);
					Иначе
					ТабДок.Область(ТекОбл.Верх, ТекОбл.Право, ТекОбл.Низ, ТекОбл.Право).Шрифт = Новый Шрифт(,,Истина);
					КонецЕсли;
			КонецЕсли; 				
		КонецЦикла;
	ОблПЗРемонт.Параметры.СтатусРемонта = СтатусРемонта;
	ОблПЗРемонт.Параметры.СписокРемонтныхКарт = СписокРемонтныхКарт;
	ТабДок.Присоединить(ОблПЗРемонт);			
	КонецЦикла;		
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого РМ Из СписокРМ Цикл
	ТабДок.Присоединить(ОблКонецРабочееМесто);
	КонецЦикла;
ТабДок.Присоединить(ОблКонецРемонт);
ТабДок.ФиксацияСверху = 4;
ТабДок.ФиксацияСлева = 7;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
ПолучитьСписокРМ();
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокРМ()
	Если Не Отчет.МТК.Пустая() Тогда
	Линейка = Отчет.МТК.Линейка; 
	Иначе
		Если Отчет.Линейка.Пустая() Тогда
		Возврат;
		КонецЕсли; 
	Линейка = Отчет.Линейка;
	КонецЕсли; 
СписокРМ.Очистить();
Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка,
	|	РабочиеМестаЛинеек.ПометкаУдаления,
	|	РабочиеМестаЛинеек.Код КАК Код,
	|	РабочиеМестаЛинеек.Линейка,
	|	РабочиеМестаЛинеек.Наименование
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка = &Линейка
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
Запрос.УстановитьПараметр("Линейка", Линейка);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРМ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СписокЗначений") Тогда
	СтандартнаяОбработка = Ложь;
		Если Расшифровка.Количество() > 1 Тогда
		РК = Расшифровка.ВыбратьЭлемент();
			Если РК <> Неопределено Тогда
			ОткрытьФорму("Документ.РемонтнаяКарта.Форма.ФормаДокумента",Новый Структура("Ключ",РК.Значение));
			КонецЕсли;
		ИначеЕсли Расшифровка.Количество() = 1 Тогда
		ОткрытьФорму("Документ.РемонтнаяКарта.Форма.ФормаДокумента",Новый Структура("Ключ",Расшифровка[0].Значение));
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.ДатаНачала = НачалоДня(ТекущаяДата());
Отчет.ДатаОкончания = ТекущаяДата();
КонецПроцедуры
